writing/university-courses/university-courses.org
#+TITLE: Jeremy's University Courses
#+AUTHOR: Jeremy Barisch-Rooney

* Computational Science

** Introduction to Computational Science (UvA)
   
*** Objectives

 The aim of this course is to provide an overview of Computational Science and
 modelling techniques available to the Computational Scientist. We will do this
 by considering one specific application (spreading of infectious diseases) and
 formulating different types of models and simulations, thus not only exploring
 the rich set of modelling paradigms available to us, but also diving deep in the
 specific application field. You will also be exposed to recent research results
 from the Computational Science Lab, to see other examples of Computational
 Science in action.

*** Contents

 Modelling and Simulation, spreading of infectious disease, SIR model and
 variants, ODE, PDE, CAs, Networks, ABM. Acquired knowledge will be applied in in
 a number of lab assignments, covering the whole chain from model description and
 simulation, model verification and validation, to data gathering and analysis .
  
** Numerical Algorithms (UvA)
   
*** Objectives

To get an overview of basic Numerical Algorithms.

*** Contents

The course gives a broad overview of basic numerical methods for solving Linear
Systems, Least Squares problems, Eigenvalue problems, Nonlinear equations,
Optimization problems, Interpolation and Quadrature problems, and Ordinary
Differential Equations. These methods form the basis for many numerical
algorithms used in computational science and engineering.

** Agent-based Modelling (UvA)
   
*** Objectives

At the end of the course, the student will be able to

- Define what Agent-Based models (ABMs) are.
- Compare different methods for developing ABMs
- Properly analyse the output of an ABM
- Summarize and Compare existing ABM
- Develop your own Agent-based Model
- Properly report on your ABM (Scientific paper)

*** Contents

The course provides a broad introduction to the field of ABM. It includes a
series of 6 2 hour lectures covering the following topics:

- Introduction and Classic Models (Epstein, Schelling, Axtell)
- Agents and AI, a view of agency and agents as defined by the field of
  Artificial Intelligence
- Game Theory & Agents, covering basic game theory and evolutionary game theory
  (Iterated & Evolutionary Prisoners Dilemma).
- Discrete Choice Theory for ABM - Logit, Probit Models and more.
- Sensitivity Analysis Methods for ABM - OFAT, Regression methods and Sobol.
- Validation for ABM (covering methodologies and challenges in validating ABM).

The course also includes practical lectures using (MESA & Python), these
practical lectures include exercises and questions required each week.

** Complex System Simulation (UvA)
   
