writing/university-courses/university-courses.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-04 Thu 11:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jeremy's University Courses</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jeremy Barisch-Rooney" />
</head>
<body>
<div id="content">
<h1 class="title">Jeremy's University Courses</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3cca454">1. Department of Computational Science</a>
<ul>
<li><a href="#org312c55e">1.1. Introduction to Computational Science (UvA)</a>
<ul>
<li><a href="#org4bef1d6">1.1.1. Objectives</a></li>
<li><a href="#org9b31da3">1.1.2. Contents</a></li>
</ul>
</li>
<li><a href="#orgf4b4f59">1.2. Numerical Algorithms (UvA)</a>
<ul>
<li><a href="#org18d06cc">1.2.1. Objectives</a></li>
<li><a href="#org8c4d6f3">1.2.2. Contents</a></li>
</ul>
</li>
<li><a href="#org707caa7">1.3. Agent-based Modelling (UvA)</a>
<ul>
<li><a href="#org414f2a0">1.3.1. Objectives</a></li>
<li><a href="#orgbce41a4">1.3.2. Contents</a></li>
</ul>
</li>
<li><a href="#org0ca7528">1.4. Complex System Simulation (UvA)</a>
<ul>
<li><a href="#orga9e24d1">1.4.1. Objectives</a></li>
<li><a href="#org5608435">1.4.2. Contents</a></li>
</ul>
</li>
<li><a href="#org105957a">1.5. Scientific Computing (UvA)</a>
<ul>
<li><a href="#orgf9ead3c">1.5.1. Objectives</a></li>
<li><a href="#org7182e9a">1.5.2. Contents</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8f9cea">2. Artificial Intelligence</a>
<ul>
<li><a href="#org35ef794">2.1. Evolutionary Computing (VU)</a>
<ul>
<li><a href="#orgf229d66">2.1.1. Objectives</a></li>
<li><a href="#org51d9cd1">2.1.2. Content</a></li>
</ul>
</li>
<li><a href="#org5b37a14">2.2. Computational Intelligence (UvA)</a>
<ul>
<li><a href="#org1507382">2.2.1. Objectives</a></li>
<li><a href="#orgf04058b">2.2.2. Contents</a></li>
</ul>
</li>
<li><a href="#orga743b77">2.3. Data Mining Techniques (VU)</a>
<ul>
<li><a href="#orgd50333f">2.3.1. Objectives</a></li>
<li><a href="#org9c89428">2.3.2. Contents</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf2ca04b">3. Computer Science</a>
<ul>
<li><a href="#org8e01030">3.1. Performance of Networked Systems (VU)</a>
<ul>
<li><a href="#org6d2e6cd">3.1.1. Contents</a></li>
<li><a href="#orge540424">3.1.2. Objectives</a></li>
</ul>
</li>
<li><a href="#orgfccf856">3.2. Experimental Design &amp; Data Analysis (VU)</a>
<ul>
<li><a href="#orgd3c73de">3.2.1. Objectives</a></li>
<li><a href="#org3dd112c">3.2.2. Contents</a></li>
</ul>
</li>
<li><a href="#orgc52c678">3.3. The Social Web (VU)</a>
<ul>
<li><a href="#org61c5dbe">3.3.1. Objectives</a></li>
<li><a href="#org584789e">3.3.2. Contents</a></li>
</ul>
</li>
<li><a href="#orge7ef6da">3.4. Distributed Algorithms (VU)</a>
<ul>
<li><a href="#org754d506">3.4.1. Objectives</a></li>
<li><a href="#orgd6dbed6">3.4.2. Contents</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfe150e9">4. Bioinformatics</a>
<ul>
<li><a href="#orgfd44f82">4.1. Algorithms in Sequence Analysis (VU)</a>
<ul>
<li><a href="#org60a5fec">4.1.1. Objectives</a></li>
<li><a href="#orgc310a35">4.1.2. Contents</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3cca454" class="outline-2">
<h2 id="org3cca454"><span class="section-number-2">1</span> Department of Computational Science</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org312c55e" class="outline-3">
<h3 id="org312c55e"><span class="section-number-3">1.1</span> Introduction to Computational Science (UvA)</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org4bef1d6" class="outline-4">
<h4 id="org4bef1d6"><span class="section-number-4">1.1.1</span> Objectives</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The aim of this course is to provide an overview of Computational Science and
modelling techniques available to the Computational Scientist. We will do this
by considering one specific application (spreading of infectious diseases) and
formulating different types of models and simulations, thus not only exploring
the rich set of modelling paradigms available to us, but also diving deep in the
specific application field. You will also be exposed to recent research results
from the Computational Science Lab, to see other examples of Computational
Science in action.
</p>
</div>
</div>

<div id="outline-container-org9b31da3" class="outline-4">
<h4 id="org9b31da3"><span class="section-number-4">1.1.2</span> Contents</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Modelling and Simulation, spreading of infectious disease, SIR model and
variants, ODE, PDE, CAs, Networks, ABM. Acquired knowledge will be applied in in
a number of lab assignments, covering the whole chain from model description and
simulation, model verification and validation, to data gathering and analysis .
</p>
</div>
</div>
</div>

<div id="outline-container-orgf4b4f59" class="outline-3">
<h3 id="orgf4b4f59"><span class="section-number-3">1.2</span> Numerical Algorithms (UvA)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org18d06cc" class="outline-4">
<h4 id="org18d06cc"><span class="section-number-4">1.2.1</span> Objectives</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
To get an overview of basic Numerical Algorithms.
</p>
</div>
</div>

<div id="outline-container-org8c4d6f3" class="outline-4">
<h4 id="org8c4d6f3"><span class="section-number-4">1.2.2</span> Contents</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
The course gives a broad overview of basic numerical methods for solving Linear
Systems, Least Squares problems, Eigenvalue problems, Nonlinear equations,
Optimization problems, Interpolation and Quadrature problems, and Ordinary
Differential Equations. These methods form the basis for many numerical
algorithms used in computational science and engineering.
</p>
</div>
</div>
</div>

<div id="outline-container-org707caa7" class="outline-3">
<h3 id="org707caa7"><span class="section-number-3">1.3</span> Agent-based Modelling (UvA)</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org414f2a0" class="outline-4">
<h4 id="org414f2a0"><span class="section-number-4">1.3.1</span> Objectives</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
At the end of the course, the student will be able to
</p>

<ul class="org-ul">
<li>Define what Agent-Based models (ABMs) are.</li>
<li>Compare different methods for developing ABMs</li>
<li>Properly analyse the output of an ABM</li>
<li>Summarize and Compare existing ABM</li>
<li>Develop your own Agent-based Model</li>
<li>Properly report on your ABM (Scientific paper)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbce41a4" class="outline-4">
<h4 id="orgbce41a4"><span class="section-number-4">1.3.2</span> Contents</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
The course provides a broad introduction to the field of ABM. It includes a
series of 6 2 hour lectures covering the following topics:
</p>

<ul class="org-ul">
<li>Introduction and Classic Models (Epstein, Schelling, Axtell)</li>
<li>Agents and AI, a view of agency and agents as defined by the field of
Artificial Intelligence</li>
<li>Game Theory &amp; Agents, covering basic game theory and evolutionary game theory
(Iterated &amp; Evolutionary Prisoners Dilemma).</li>
<li>Discrete Choice Theory for ABM - Logit, Probit Models and more.</li>
<li>Sensitivity Analysis Methods for ABM - OFAT, Regression methods and Sobol.</li>
<li>Validation for ABM (covering methodologies and challenges in validating ABM).</li>
</ul>

<p>
The course also includes practical lectures using (MESA &amp; Python), these
practical lectures include exercises and questions required each week.
</p>
</div>
</div>
</div>

<div id="outline-container-org0ca7528" class="outline-3">
<h3 id="org0ca7528"><span class="section-number-3">1.4</span> Complex System Simulation (UvA)</h3>
<div class="outline-text-3" id="text-1-4">
</div>
