writing/university-courses/university-courses.tex
% Created 2019-04-04 Thu 11:09
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jeremy Barisch-Rooney}
\date{\today}
\title{Jeremy's University Courses}
\hypersetup{
 pdfauthor={Jeremy Barisch-Rooney},
 pdftitle={Jeremy's University Courses},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Department of Computational Science}
\label{sec:orgf4037c9}

\subsection{Introduction to Computational Science (UvA)}
\label{sec:org9a4d46f}

\subsubsection{Objectives}
\label{sec:orgaf48804}

The aim of this course is to provide an overview of Computational Science and
modelling techniques available to the Computational Scientist. We will do this
by considering one specific application (spreading of infectious diseases) and
formulating different types of models and simulations, thus not only exploring
the rich set of modelling paradigms available to us, but also diving deep in the
specific application field. You will also be exposed to recent research results
from the Computational Science Lab, to see other examples of Computational
Science in action.

\subsubsection{Contents}
\label{sec:org49f6142}

Modelling and Simulation, spreading of infectious disease, SIR model and
variants, ODE, PDE, CAs, Networks, ABM. Acquired knowledge will be applied in in
a number of lab assignments, covering the whole chain from model description and
simulation, model verification and validation, to data gathering and analysis .

\subsection{Numerical Algorithms (UvA)}
\label{sec:orga64f017}

\subsubsection{Objectives}
\label{sec:org54c0a92}

To get an overview of basic Numerical Algorithms.

\subsubsection{Contents}
\label{sec:org420183f}

The course gives a broad overview of basic numerical methods for solving Linear
Systems, Least Squares problems, Eigenvalue problems, Nonlinear equations,
Optimization problems, Interpolation and Quadrature problems, and Ordinary
Differential Equations. These methods form the basis for many numerical
algorithms used in computational science and engineering.

\subsection{Agent-based Modelling (UvA)}
\label{sec:orge514ab6}

\subsubsection{Objectives}
\label{sec:org777be03}

At the end of the course, the student will be able to

\begin{itemize}
\item Define what Agent-Based models (ABMs) are.
\item Compare different methods for developing ABMs
\item Properly analyse the output of an ABM
\item Summarize and Compare existing ABM
\item Develop your own Agent-based Model
\item Properly report on your ABM (Scientific paper)
\end{itemize}

\subsubsection{Contents}
\label{sec:org0557935}

The course provides a broad introduction to the field of ABM. It includes a
series of 6 2 hour lectures covering the following topics:

\begin{itemize}
\item Introduction and Classic Models (Epstein, Schelling, Axtell)
\item Agents and AI, a view of agency and agents as defined by the field of
Artificial Intelligence
\item Game Theory \& Agents, covering basic game theory and evolutionary game theory
(Iterated \& Evolutionary Prisoners Dilemma).
\item Discrete Choice Theory for ABM - Logit, Probit Models and more.
\item Sensitivity Analysis Methods for ABM - OFAT, Regression methods and Sobol.
\item Validation for ABM (covering methodologies and challenges in validating ABM).
\end{itemize}

The course also includes practical lectures using (MESA \& Python), these
practical lectures include exercises and questions required each week.

\subsection{Complex System Simulation (UvA)}
\label{sec:org10f6f53}
