writing/university-courses/university-courses.org
*** Objectives

The student will be able to:

- Explain the concept of emergence;
- Name and reason about different types of emergent phenomena, such as chaos,
  phase transitions, network connectivity, and complexity;
- Name and reason about different types of computational models used to study
  these phenomena;
- Implement these models to reproduce a given emergent phenomenon;
- Compare model outcomes with predictions from (mean-field) theory;
- Interpret and use the model outcomes in terms of practical applications;
- Implement and study interventions and what-if scenarios to improve/optimize
  with respect to a practical application.

*** Contents

The course has two major components, the first two weeks will include lectures
covering concepts and methods related to Complex System Simulation. The second
two weeks will be group projects (2-3 students), where each group will develop a
simulation of a complex system and conduct research using that simulation.

The group project should reflect the concepts and methods covered in the first
two weeks, however students are also encouraged to self study and suggest
alternative ideas.

Topics to be covered (may change):

- Introduction to Cellular Automata (1D/2D CA, rule codes, phenomenological
  studies, behaviour classes)
- Self-Organized Criticality (Sandpile Model);
- Random Networks, Scale Free Networks, Complex Networks;
- Phase Transitions;
- (Deterministic) chaos;
- Complexity;
- Algorithmic information theory.

** Scientific Computing (UvA)
   
*** Objectives

- Knowledge. The student has basic knowledge about solving (examples of) partial
  diferential equations and is able to analyze stability and accuracy of a
  numerical scheme
- Skills: The student is able to develop a computational model for solving
  examples of partial differential equations (e.g wave equation, diffusion
  equations) in (simple) applications

*** Contents

The focus is on developing numerical algorithms (the emphasis is on finite
differencing) to solve prototypical partial differential equations. Examples are
the wave equation, the time-dependent diffusion equation, the Laplace equation
and reaction-diffusion equations. The validation and verification of numerical
schemes for solving these equation will discusssed, Methods for analyzing the
stability and accuracy of the numerical scheme will be discussed.

* Artificial Intelligence
  
** Evolutionary Computing (VU)
   
*** Objectives

This course has a threefold objective: 1) To learn about computational methods
based on Darwinian principles of evolution. 2) To illustrate the usage of such
methods as problem solvers and as simulation tools. 3) To gain hands-on
experience in performing computational experiments with evolutionary algorithms.

*** Content
    
The course is treating various algorithms based on the Darwinian evolution
theory. Driven by natural selection (survival of the fittest), an evolution
process is being emulated and solutions for a given problem are being "bred".
During this course all "dialects" within evolutionary computing are treated
(genetic algorithms, evolution strategies, evolutionary programming, genetic
programming). Applications in optimisation, constraint handling, machine
learning, and robotics are discussed. Specific subjects handled include: various
genetic structures (representations), selection techniques, sexual and asexual
variation operators, (self-)adaptivity. Special attention is paid to
methodological aspects, such as algorithm design and tuning. If time permits,
subjects in Artificial Life will be handled. Hands-on- experience is gained by a
compulsory programming assignment.

** Computational Intelligence (UvA)
   
*** Objectives

The overall aim of this course is to provide knowledge about concepts, theory,
and techniques used in computational intelligence and the know-how to employ
these for making intelligent machines. In particular, to enable students to:
- gain profound understanding of fundamental computational intelligence
  concepts, algorithms, and their implementation;
- understand the theoretical background of proposed solutions;
- develop skills in the use of computational intelligence and to demonstrate
  this in physical robots or virtual creatures;
- appreciate relevant current research topics in the theory and practice of
  computational intelligence.
  
