writing/university-courses/university-courses.html
<div id="outline-container-orga9e24d1" class="outline-4">
<h4 id="orga9e24d1"><span class="section-number-4">1.4.1</span> Objectives</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The student will be able to:
</p>

<ul class="org-ul">
<li>Explain the concept of emergence;</li>
<li>Name and reason about different types of emergent phenomena, such as chaos,
phase transitions, network connectivity, and complexity;</li>
<li>Name and reason about different types of computational models used to study
these phenomena;</li>
<li>Implement these models to reproduce a given emergent phenomenon;</li>
<li>Compare model outcomes with predictions from (mean-field) theory;</li>
<li>Interpret and use the model outcomes in terms of practical applications;</li>
<li>Implement and study interventions and what-if scenarios to improve/optimize
with respect to a practical application.</li>
</ul>
</div>
</div>

<div id="outline-container-org5608435" class="outline-4">
<h4 id="org5608435"><span class="section-number-4">1.4.2</span> Contents</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
The course has two major components, the first two weeks will include lectures
covering concepts and methods related to Complex System Simulation. The second
two weeks will be group projects (2-3 students), where each group will develop a
simulation of a complex system and conduct research using that simulation.
</p>

<p>
The group project should reflect the concepts and methods covered in the first
two weeks, however students are also encouraged to self study and suggest
alternative ideas.
</p>

<p>
Topics to be covered (may change):
</p>

<ul class="org-ul">
<li>Introduction to Cellular Automata (1D/2D CA, rule codes, phenomenological
studies, behaviour classes)</li>
<li>Self-Organized Criticality (Sandpile Model);</li>
<li>Random Networks, Scale Free Networks, Complex Networks;</li>
<li>Phase Transitions;</li>
<li>(Deterministic) chaos;</li>
<li>Complexity;</li>
<li>Algorithmic information theory.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org105957a" class="outline-3">
<h3 id="org105957a"><span class="section-number-3">1.5</span> Scientific Computing (UvA)</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgf9ead3c" class="outline-4">
<h4 id="orgf9ead3c"><span class="section-number-4">1.5.1</span> Objectives</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Knowledge. The student has basic knowledge about solving (examples of) partial
diferential equations and is able to analyze stability and accuracy of a
numerical scheme</li>
<li>Skills: The student is able to develop a computational model for solving
examples of partial differential equations (e.g wave equation, diffusion
equations) in (simple) applications</li>
</ul>
</div>
</div>

<div id="outline-container-org7182e9a" class="outline-4">
<h4 id="org7182e9a"><span class="section-number-4">1.5.2</span> Contents</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
The focus is on developing numerical algorithms (the emphasis is on finite
differencing) to solve prototypical partial differential equations. Examples are
the wave equation, the time-dependent diffusion equation, the Laplace equation
and reaction-diffusion equations. The validation and verification of numerical
schemes for solving these equation will discusssed, Methods for analyzing the
stability and accuracy of the numerical scheme will be discussed.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orga8f9cea" class="outline-2">
<h2 id="orga8f9cea"><span class="section-number-2">2</span> Artificial Intelligence</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org35ef794" class="outline-3">
<h3 id="org35ef794"><span class="section-number-3">2.1</span> Evolutionary Computing (VU)</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf229d66" class="outline-4">
<h4 id="orgf229d66"><span class="section-number-4">2.1.1</span> Objectives</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
This course has a threefold objective: 1) To learn about computational methods
based on Darwinian principles of evolution. 2) To illustrate the usage of such
methods as problem solvers and as simulation tools. 3) To gain hands-on
experience in performing computational experiments with evolutionary algorithms.
</p>
</div>
</div>

<div id="outline-container-org51d9cd1" class="outline-4">
<h4 id="org51d9cd1"><span class="section-number-4">2.1.2</span> Content</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The course is treating various algorithms based on the Darwinian evolution
theory. Driven by natural selection (survival of the fittest), an evolution
process is being emulated and solutions for a given problem are being "bred".
During this course all "dialects" within evolutionary computing are treated
(genetic algorithms, evolution strategies, evolutionary programming, genetic
programming). Applications in optimisation, constraint handling, machine
learning, and robotics are discussed. Specific subjects handled include: various
genetic structures (representations), selection techniques, sexual and asexual
variation operators, (self-)adaptivity. Special attention is paid to
methodological aspects, such as algorithm design and tuning. If time permits,
subjects in Artificial Life will be handled. Hands-on- experience is gained by a
compulsory programming assignment.
</p>
</div>
</div>
</div>

<div id="outline-container-org5b37a14" class="outline-3">
<h3 id="org5b37a14"><span class="section-number-3">2.2</span> Computational Intelligence (UvA)</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org1507382" class="outline-4">
<h4 id="org1507382"><span class="section-number-4">2.2.1</span> Objectives</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The overall aim of this course is to provide knowledge about concepts, theory,
and techniques used in computational intelligence and the know-how to employ
these for making intelligent machines. In particular, to enable students to:
</p>
<ul class="org-ul">
<li>gain profound understanding of fundamental computational intelligence
concepts, algorithms, and their implementation;</li>
<li>understand the theoretical background of proposed solutions;</li>
<li>develop skills in the use of computational intelligence and to demonstrate
this in physical robots or virtual creatures;</li>
<li>appreciate relevant current research topics in the theory and practice of
computational intelligence.</li>
</ul>
</div>
</div>
