writing/university-courses/university-courses.html

<div id="outline-container-orgf04058b" class="outline-4">
<h4 id="orgf04058b"><span class="section-number-4">2.2.2</span> Contents</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Computational intelligence can be positioned as the research area that follows a
bottom-up approach to developing systems that exhibit intelligent behavior in
complex environments. It is often contrasted to the top-down approach followed
by traditional artificial intelligence. Typically, sub-symbolic and
nature-inspired methods are adopted that tolerate incomplete, imprecise and
uncertain knowledge. As a consequence, the resulting approaches allow for
approximate, manageable, robust and resource-efﬁcient solutions.
</p>

<p>
This course covers nature-inspired techniques such as neural networks,
evolutionary algorithms and swarm intelligence. Special attention is paid to
using such techniques for making autonomous and adaptive machines.
</p>
</div>
</div>
</div>

<div id="outline-container-orga743b77" class="outline-3">
<h3 id="orga743b77"><span class="section-number-3">2.3</span> Data Mining Techniques (VU)</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgd50333f" class="outline-4">
<h4 id="orgd50333f"><span class="section-number-4">2.3.1</span> Objectives</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
The aim of the course is that students acquire data mining knowledge and skills
that they can apply in a business environment. How the aims are to be achieved:
Students will acquire knowledge and skills mainly through the following: an
overview of the most common data mining algorithms and techniques (in lectures),
a survey of typical and interesting data mining applications, and practical
assignments to gain "hands on" experience. The application of skills in a
business environment will be simulated through various assignments of the
course.
</p>
</div>
</div>

<div id="outline-container-org9c89428" class="outline-4">
<h4 id="org9c89428"><span class="section-number-4">2.3.2</span> Contents</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
The course will provide a survey of basic data mining techniques and their
applications for solving real life problems. After a general introduction to
Data Mining we will discuss some "classical" algorithms like Naive Bayes,
Decision Trees, Association Rules, etc., and some recently discovered methods
such as boosting, Support Vector Machines, and co-learning. A number of
successful applications of data mining will also be discussed: marketing, fraud
detection, text and Web mining, possibly bioinformatics. In addition to
lectures, there will be an extensive practical part, where students will
experiment with various data mining algorithms and data sets. The grade for the
course will be based on these practical assignments (i.e., there will be no
final examination).
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf2ca04b" class="outline-2">
<h2 id="orgf2ca04b"><span class="section-number-2">3</span> Computer Science</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8e01030" class="outline-3">
<h3 id="org8e01030"><span class="section-number-3">3.1</span> Performance of Networked Systems (VU)</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org6d2e6cd" class="outline-4">
<h4 id="org6d2e6cd"><span class="section-number-4">3.1.1</span> Contents</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Students will acquire basic knowledge of:
</p>
<ul class="org-ul">
<li>performance aspects of networked systems, consisting of servers, services, and
clients</li>
<li>performance engineering principles and methods,</li>
<li>quantitative models for predicting and optimizing the performance</li>
</ul>
<p>
of networked systems,
</p>
<ul class="org-ul">
<li>quantitative models for planning capacity of networked systems. Students will
gain experience in engineering and planning performance of networked systems,
and will learn how to tackle practical performance problems arising in the ICT
industry.</li>
</ul>
</div>
</div>

<div id="outline-container-orge540424" class="outline-4">
<h4 id="orge540424"><span class="section-number-4">3.1.2</span> Objectives</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Over the past few decades, information and communication technology (ICT) has
become ubiquitous and globally interconnected. As a consequence, our information
and communication systems are expected to process huge amounts of (digital)
information, which puts a tremendous burden on our ICT infrastructure. At the
same time, our modern society has become largely dependent on the
well-functioning of our ICT systems; large-scale system failures and perceivable
Quality of Service (QoS) degradation may completely disrupt our daily lives and
have huge impact on our economy. Motivated by this, the course will focus on
performance-related issues of networked systems. In the first part, we study
capacity planning and modeling for server systems and networks. In the second
part, we study the client side of performance while focusing on web applications
for both desktop and mobile devices. We address questions like:
</p>
<ul class="org-ul">
<li>How can we design and engineer networked systems for performance?</li>
<li>How can we plan server capacity in networked systems?</li>
<li>How can web applications improve performance across wired and wireless
networks?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfccf856" class="outline-3">
<h3 id="orgfccf856"><span class="section-number-3">3.2</span> Experimental Design &amp; Data Analysis (VU)</h3>
<div class="outline-text-3" id="text-3-2">
</div>
