writing/university-courses/university-courses.tex

\subsubsection{Contents}
\label{sec:org2ea9aa5}

Computational intelligence can be positioned as the research area that follows a
bottom-up approach to developing systems that exhibit intelligent behavior in
complex environments. It is often contrasted to the top-down approach followed
by traditional artificial intelligence. Typically, sub-symbolic and
nature-inspired methods are adopted that tolerate incomplete, imprecise and
uncertain knowledge. As a consequence, the resulting approaches allow for
approximate, manageable, robust and resource-efﬁcient solutions.

This course covers nature-inspired techniques such as neural networks,
evolutionary algorithms and swarm intelligence. Special attention is paid to
using such techniques for making autonomous and adaptive machines.

\subsection{Data Mining Techniques (VU)}
\label{sec:orgf877fa8}

\subsubsection{Objectives}
\label{sec:org31972c3}

The aim of the course is that students acquire data mining knowledge and skills
that they can apply in a business environment. How the aims are to be achieved:
Students will acquire knowledge and skills mainly through the following: an
overview of the most common data mining algorithms and techniques (in lectures),
a survey of typical and interesting data mining applications, and practical
assignments to gain "hands on" experience. The application of skills in a
business environment will be simulated through various assignments of the
course.

\subsubsection{Contents}
\label{sec:org78ef43c}

The course will provide a survey of basic data mining techniques and their
applications for solving real life problems. After a general introduction to
Data Mining we will discuss some "classical" algorithms like Naive Bayes,
Decision Trees, Association Rules, etc., and some recently discovered methods
such as boosting, Support Vector Machines, and co-learning. A number of
successful applications of data mining will also be discussed: marketing, fraud
detection, text and Web mining, possibly bioinformatics. In addition to
lectures, there will be an extensive practical part, where students will
experiment with various data mining algorithms and data sets. The grade for the
course will be based on these practical assignments (i.e., there will be no
final examination).

\section{Computer Science}
\label{sec:org0c8bd2b}

\subsection{Performance of Networked Systems (VU)}
\label{sec:orgaef3109}

\subsubsection{Contents}
\label{sec:orgb51a843}

Students will acquire basic knowledge of:
\begin{itemize}
\item performance aspects of networked systems, consisting of servers, services, and
clients
\item performance engineering principles and methods,
\item quantitative models for predicting and optimizing the performance
\end{itemize}
of networked systems,
\begin{itemize}
\item quantitative models for planning capacity of networked systems. Students will
gain experience in engineering and planning performance of networked systems,
and will learn how to tackle practical performance problems arising in the ICT
industry.
\end{itemize}

\subsubsection{Objectives}
\label{sec:org9481032}

Over the past few decades, information and communication technology (ICT) has
become ubiquitous and globally interconnected. As a consequence, our information
and communication systems are expected to process huge amounts of (digital)
information, which puts a tremendous burden on our ICT infrastructure. At the
same time, our modern society has become largely dependent on the
well-functioning of our ICT systems; large-scale system failures and perceivable
Quality of Service (QoS) degradation may completely disrupt our daily lives and
have huge impact on our economy. Motivated by this, the course will focus on
performance-related issues of networked systems. In the first part, we study
capacity planning and modeling for server systems and networks. In the second
part, we study the client side of performance while focusing on web applications
for both desktop and mobile devices. We address questions like:
\begin{itemize}
\item How can we design and engineer networked systems for performance?
\item How can we plan server capacity in networked systems?
\item How can web applications improve performance across wired and wireless
networks?
\end{itemize}

\subsection{Experimental Design \& Data Analysis (VU)}
\label{sec:orga4635ce}
