writing/university-courses/university-courses.org
*** Objectives
   
In this course the student will get acquainted with the most common experimental
designs and regression models, nonparametric Vrije Universiteit Amsterdam -
Faculteit der Exacte Wetenschappen - M Computer Science (joint degree) -
2017-2018 18-7-2018 - Pagina 39 van 73 tests and bootstrap methods will be
discussed. On completion of this course the student should be able to:
- design experiments and analyse the results according to the design, - analyse
  data using the common ANOVA designs,
- analyse data using linear regression or a generalized linear regression model,
- perform basic nonparametric tests,
- perform bootstrap and permutation tests.
  
*** Contents

Regression models try to explain or predict a dependent variable using measured
independent variables. Statistical methods are needed if there is random
variation in the dependent variables. We will discuss multiple linear
regression, analyses of variance (ANOVA), generalized linear regression models.
All methods will be illustrated with practical examples. Especially in the case
of ANOVA it is necessary that the study is well designed in order to draw sound
conclusions from an experiment or survey. In this course a few well known
designs (completely randomized, randomized block etc.) and the associated
analyses of variance are discussed. The remainder of the course is be dedicated
to non-parametric testing methods and bootstrap methods:
- Wilcoxon test for (one and two samples), - Kolmogorov-Smirnov test (two
  samples), - rank correlation tests,
- permutation and bootstrap tests.
All analyses are carried out by using the statistical package R.

** The Social Web (VU)
   
*** Objectives

In this course the students will learn theory and methods concerning
communication and interaction in a Web context. The focus is on
distributed user data and devices in the context of the Social Web.
Course content

*** Contents

This course will cover theory, methods and techniques for:

- personalization for Web applications;
- Web user & context modelling;
- user-generated content and metadata;
- multi-device interaction;
- usage of social-web data.

** Distributed Algorithms (VU)
   
*** Objectives

The main objective is to provide students with an algorithmic frame of
mind for solving fundamental problems in distributed computing. They
obtain insight into concurrency concepts, and are offered a bird's-eye
view on a wide range of algorithms for basic and important challenges in
distributed systems.

Characteristic of the course is that correctness arguments and
complexity calculations of distributed algorithms are provided in an
intuitive fashion and by means of examples and exercises.

*** Contents

The following topics are treated in the course: Logical clocks,
snapshots, graph traversal, termination detection, garbage collection,
deadlock detection, routing, election, minimal spanning trees, anonymous
networks, checkpointing, fault tolerance, failure detection, consensus,
mutual exclusion, self-stabilization, blockchains, database transactions

* Bioinformatics
  
** Algorithms in Sequence Analysis (VU)
   
*** Objectives

Have you ever wondered how we can track a gene across 3 billion years of
evolution? Sequence alignment can be used to compare genes from humans and
bacteria, using a dynamic programming algorithm. In this course we focus on
algorithms for biological sequences that can be applied to real scientific
problems in biology.

Students will obtain in-depth knowledge about the theory of sequence analysis
methods. They will also develop understanding and skills to apply the algorithms
to protein and DNA sequences. We would like to stress that no biological
knowledge is required to enter this course.

Goals
- At the end of the course, the student will be aware of the major
issues, methodology and available algorithms in sequence analysis.
- At the end of the course, the student will have hands-on experience in
tackling biological problems using sequence analysis algorithms and applying the
general statistical framework of Hidden Markov Models.
- At the end of the course, the student will be able to implement
several of the most important algorithms in sequence analysis. Course content

