writing/university-courses/university-courses.html
<div id="outline-container-orgd3c73de" class="outline-4">
<h4 id="orgd3c73de"><span class="section-number-4">3.2.1</span> Objectives</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
In this course the student will get acquainted with the most common experimental
designs and regression models, nonparametric Vrije Universiteit Amsterdam -
Faculteit der Exacte Wetenschappen - M Computer Science (joint degree) -
2017-2018 18-7-2018 - Pagina 39 van 73 tests and bootstrap methods will be
discussed. On completion of this course the student should be able to:
</p>
<ul class="org-ul">
<li>design experiments and analyse the results according to the design, - analyse
data using the common ANOVA designs,</li>
<li>analyse data using linear regression or a generalized linear regression model,</li>
<li>perform basic nonparametric tests,</li>
<li>perform bootstrap and permutation tests.</li>
</ul>
</div>
</div>

<div id="outline-container-org3dd112c" class="outline-4">
<h4 id="org3dd112c"><span class="section-number-4">3.2.2</span> Contents</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Regression models try to explain or predict a dependent variable using measured
independent variables. Statistical methods are needed if there is random
variation in the dependent variables. We will discuss multiple linear
regression, analyses of variance (ANOVA), generalized linear regression models.
All methods will be illustrated with practical examples. Especially in the case
of ANOVA it is necessary that the study is well designed in order to draw sound
conclusions from an experiment or survey. In this course a few well known
designs (completely randomized, randomized block etc.) and the associated
analyses of variance are discussed. The remainder of the course is be dedicated
to non-parametric testing methods and bootstrap methods:
</p>
<ul class="org-ul">
<li>Wilcoxon test for (one and two samples), - Kolmogorov-Smirnov test (two
samples), - rank correlation tests,</li>
<li>permutation and bootstrap tests.</li>
</ul>
<p>
All analyses are carried out by using the statistical package R.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc52c678" class="outline-3">
<h3 id="orgc52c678"><span class="section-number-3">3.3</span> The Social Web (VU)</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org61c5dbe" class="outline-4">
<h4 id="org61c5dbe"><span class="section-number-4">3.3.1</span> Objectives</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
In this course the students will learn theory and methods concerning
communication and interaction in a Web context. The focus is on
distributed user data and devices in the context of the Social Web.
Course content
</p>
</div>
</div>

<div id="outline-container-org584789e" class="outline-4">
<h4 id="org584789e"><span class="section-number-4">3.3.2</span> Contents</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
This course will cover theory, methods and techniques for:
</p>

<ul class="org-ul">
<li>personalization for Web applications;</li>
<li>Web user &amp; context modelling;</li>
<li>user-generated content and metadata;</li>
<li>multi-device interaction;</li>
<li>usage of social-web data.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge7ef6da" class="outline-3">
<h3 id="orge7ef6da"><span class="section-number-3">3.4</span> Distributed Algorithms (VU)</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org754d506" class="outline-4">
<h4 id="org754d506"><span class="section-number-4">3.4.1</span> Objectives</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
The main objective is to provide students with an algorithmic frame of
mind for solving fundamental problems in distributed computing. They
obtain insight into concurrency concepts, and are offered a bird's-eye
view on a wide range of algorithms for basic and important challenges in
distributed systems.
</p>

<p>
Characteristic of the course is that correctness arguments and
complexity calculations of distributed algorithms are provided in an
intuitive fashion and by means of examples and exercises.
</p>
</div>
</div>

<div id="outline-container-orgd6dbed6" class="outline-4">
<h4 id="orgd6dbed6"><span class="section-number-4">3.4.2</span> Contents</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
The following topics are treated in the course: Logical clocks,
snapshots, graph traversal, termination detection, garbage collection,
deadlock detection, routing, election, minimal spanning trees, anonymous
networks, checkpointing, fault tolerance, failure detection, consensus,
mutual exclusion, self-stabilization, blockchains, database transactions
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfe150e9" class="outline-2">
<h2 id="orgfe150e9"><span class="section-number-2">4</span> Bioinformatics</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfd44f82" class="outline-3">
<h3 id="orgfd44f82"><span class="section-number-3">4.1</span> Algorithms in Sequence Analysis (VU)</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org60a5fec" class="outline-4">
<h4 id="org60a5fec"><span class="section-number-4">4.1.1</span> Objectives</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Have you ever wondered how we can track a gene across 3 billion years of
evolution? Sequence alignment can be used to compare genes from humans and
bacteria, using a dynamic programming algorithm. In this course we focus on
algorithms for biological sequences that can be applied to real scientific
problems in biology.
</p>

<p>
Students will obtain in-depth knowledge about the theory of sequence analysis
methods. They will also develop understanding and skills to apply the algorithms
to protein and DNA sequences. We would like to stress that no biological
knowledge is required to enter this course.
</p>

<p>
Goals
</p>
<ul class="org-ul">
<li>At the end of the course, the student will be aware of the major</li>
</ul>
<p>
issues, methodology and available algorithms in sequence analysis.
</p>
<ul class="org-ul">
<li>At the end of the course, the student will have hands-on experience in</li>
</ul>
<p>
tackling biological problems using sequence analysis algorithms and applying the
general statistical framework of Hidden Markov Models.
</p>
<ul class="org-ul">
<li>At the end of the course, the student will be able to implement</li>
</ul>
<p>
several of the most important algorithms in sequence analysis. Course content
</p>
</div>
</div>
