writing/university-courses/university-courses.org
*** Contents
 
Theory:
- Dynamic programming, database searching, pairwise and multiple
alignment, probabilistic methods including hidden markov models, pattern
matching, entropy measures, evolutionary models, and phylogeny.

Practical:
- Programming (in Python) own alignment algorithm based on dynamic
programming
- Reverse translation and dynamic programming
- Homology searching and pattern recognition using biological and
disease examples
- Multiple alignment of biological sequences
- Entropy-based functional residues prediction
- Programming (in Python) own implementation of Hidden Markov Models and
using it to predict protein domain structure
