writing/university-courses/university-courses.html

<div id="outline-container-orgc310a35" class="outline-4">
<h4 id="orgc310a35"><span class="section-number-4">4.1.2</span> Contents</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Theory:
</p>
<ul class="org-ul">
<li>Dynamic programming, database searching, pairwise and multiple</li>
</ul>
<p>
alignment, probabilistic methods including hidden markov models, pattern
matching, entropy measures, evolutionary models, and phylogeny.
</p>

<p>
Practical:
</p>
<ul class="org-ul">
<li>Programming (in Python) own alignment algorithm based on dynamic</li>
</ul>
<p>
programming
</p>
<ul class="org-ul">
<li>Reverse translation and dynamic programming</li>
<li>Homology searching and pattern recognition using biological and</li>
</ul>
<p>
disease examples
</p>
<ul class="org-ul">
<li>Multiple alignment of biological sequences</li>
<li>Entropy-based functional residues prediction</li>
<li>Programming (in Python) own implementation of Hidden Markov Models and</li>
</ul>
<p>
using it to predict protein domain structure
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jeremy Barisch-Rooney</p>
<p class="date">Created: 2019-04-04 Thu 11:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
