writing/university-courses/university-courses.tex

\subsubsection{Contents}
\label{sec:orgdd08a94}

Theory:
\begin{itemize}
\item Dynamic programming, database searching, pairwise and multiple
\end{itemize}
alignment, probabilistic methods including hidden markov models, pattern
matching, entropy measures, evolutionary models, and phylogeny.

Practical:
\begin{itemize}
\item Programming (in Python) own alignment algorithm based on dynamic
\end{itemize}
programming
\begin{itemize}
\item Reverse translation and dynamic programming
\item Homology searching and pattern recognition using biological and
\end{itemize}
disease examples
\begin{itemize}
\item Multiple alignment of biological sequences
\item Entropy-based functional residues prediction
\item Programming (in Python) own implementation of Hidden Markov Models and
\end{itemize}
using it to predict protein domain structure
\end{document}
